{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/10/21/hello-world/"},{"title":"PV &amp; PVC","text":"Go to section PV PV클러스터 리소스 이다. pv 와 pvc 는 1:1 바인딩이며 pvc 가 요청하는 볼륨이 pv 에 없으면 무한 대기 한다. pod 이 사용중인 pvc 는 삭제가 불가능 하다. PV volumeModes Filesystem : Pod 의 디렉토리에 마운트 됨 Block PersistentVolumeReclaimPolicyPVC 삭제시 PV 데이터에 대한 정책 Retail : 그대로 보존 Recycle : 재사용시 기존 pv 데이터들 삭제 후 재사용 (이건 사용 안함) Delete : 볼륨 삭제 RecaimPolicy Updatekubectl patch pv -p ‘{“spec”:{“persistentVolumeReclaimPolicy”:”Retain”}}’ PV &amp; PVC YAML 샘플1234567891011121314151617181920212223242526apiVersion: v1kind: PersistentVolumemetadata: namespace: spring name: mysql-pvspec: storageClassName: local-path accessModes: - ReadWriteOnce capacity: storage: 2Gi hostPath: path: /home/master01/k8s/mysql-data---apiVersion: v1kind: PersistentVolumeClaimmetadata: namespace: spring name: mysql-pvc2spec: storageClassName: local-path1 accessModes: - ReadWriteOnce resources: requests: storage: 2Gi 참고 사이트https://kubernetes.io/ko/docs/concepts/storage/persistent-volumes/https://kubernetes.io/ko/docs/tasks/administer-cluster/change-pv-reclaim-policy/","link":"/2020/10/20/PV-PVC/"},{"title":"ReplicaSet","text":"ReplicaSet vs Replication ControllerReplicaSet 은 Replicatation Controller 의 새로운 버전이다. ReplcaSet : Set-based Selectors Replicatation Controller : Equality-based Selectors support Operation Example Command Line manifest Equality-based Service, Replication Controller = == != enviroment=prd kubectl get pods -l enviroment=prd selector: enviroment: prd Set-based Job, Deployment, ReplicaSet, Daemon Set in notin exists enviroment in (prd) kubectl get pods -l ‘enviroment in (prd)’ selector: matchExpressions:- {key: enviroment, operation: In, values: [prd]} matchLabelsselectors 에 matchLabels 가 존재할 경우 새로운 리소스들까지 지원을 해준다. manifest support selector: app: nginx Services, Replication Controller selector: matchLabels: app: nginx ReplicaSets, Deployments, Jobs, DaemonSet Persistent Volume(PV) vs Psersistent Volume Claim(PVC)PV : Piece of Storage in Clusterlifecycle : Provisioning -&gt; Binding -&gt; Using -&gt; Reclaiming Type : static, dynamic static : PV needs to be created before PVCdynamic : PV is created at same time of PVC PVC : Request for storage","link":"/2020/10/20/ReplicaSet/"}],"tags":[{"name":"K8S","slug":"K8S","link":"/tags/K8S/"},{"name":"PV","slug":"PV","link":"/tags/PV/"},{"name":"PVC","slug":"PVC","link":"/tags/PVC/"},{"name":"쿠버네티스","slug":"쿠버네티스","link":"/tags/%EC%BF%A0%EB%B2%84%EB%84%A4%ED%8B%B0%EC%8A%A4/"},{"name":"ReplicaSet","slug":"ReplicaSet","link":"/tags/ReplicaSet/"},{"name":"RS","slug":"RS","link":"/tags/RS/"}],"categories":[{"name":"Kubernetes","slug":"Kubernetes","link":"/categories/Kubernetes/"}]}